In [ ]:
# How to read TSV File.

In [2]:
import pandas as pd

In [3]:
draft2 = pd.read_table('test.tsv') # Read a tsv into a DataFrame
draft2

     a     b       c        d       e   f
0  meg  qual   benga      job  sweden NaN
1  ash    AI  mumbai  startup      uk NaN

In [4]:
df = pd.read_csv('test.tsv',sep='\t')# \n line change \t tab
df

     a     b       c        d       e   f
0  meg  qual   benga      job  sweden NaN
1  ash    AI  mumbai  startup      uk NaN

In [ ]:
# How to read text file.

In [5]:
draft3 = pd.read_table('ex3.txt')
draft3

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [6]:
data = pd.read_csv('ex1.csv')
data

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
df2 = pd.read_csv('ex1.csv',header=None)
df2

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [8]:
df3 = pd.read_csv('ex1.csv',header=None,
                 names = ['name', 'age', 'height', 'weight', 'academic'])
df3

  name age height weight academic
0    a   b      c      d  message
1    1   2      3      4    hello
2    5   6      7      8    world
3    9  10     11     12      foo

In [9]:
df = pd.read_csv('csv_mindex.csv')
df

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [10]:
df5 = pd.read_csv('csv_mindex.csv',index_col=['key1']) # set index 
df5                               # this set index method is alternative method of first method.

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

In [11]:
df5.columns

Index(['key2', 'value1', 'value2'], dtype='object')

In [12]:
df6 = pd.read_csv('csv_mindex.csv',index_col=[2])
df6

       key1 key2  value2
value1
1       one    a       2
3       one    b       4
5       one    c       6
7       one    d       8
9       two    a      10
11      two    b      12
13      two    c      14
15      two    d      16

In [13]:
data= pd.read_csv('ex4.csv')
data

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [14]:
pd.read_csv('ex4.csv',skiprows=[0,2,3]) # skip rows from their indexes.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
 # REPLACE FUNCTION ---------------------------------------------------------------------------------------

In [15]:
import pandas as pd
import numpy as np

In [16]:
df = pd.read_csv('replace_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [17]:
# Replacing single value.
new_df = df.replace(-99999, value=np.nan) # null " "
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0      0
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0      0

In [18]:
df = pd.read_csv("replace_data1.csv")
df

          day  temperature  windspeed     event
0  01-01-2017           32          6      Rain
1  01-02-2017       -99999          7     Sunny
2  01-03-2017           28     -99999      Snow
3  01-04-2017       -99999          7  no event
4  01-05-2017           32     -99999      Rain
5  01-06-2017           31          2     Sunny
6  01-06-2017           34          5  no event

In [19]:
# Replacing multiple values.
new_df = df.replace([-99999, -88888, "no event"], np.nan)
new_df

          day  temperature  windspeed  event
0  01-01-2017         32.0        6.0   Rain
1  01-02-2017          NaN        7.0  Sunny
2  01-03-2017         28.0        NaN   Snow
3  01-04-2017          NaN        7.0    NaN
4  01-05-2017         32.0        NaN   Rain
5  01-06-2017         31.0        2.0  Sunny
6  01-06-2017         34.0        5.0    NaN

In [21]:
df = pd.read_csv('replace_data1_1.csv')
df

          day  temperature  windspeed     event
0  01-01-2017           32          6      Rain
1  01-02-2017       -99999          7     Sunny
2  01-03-2017           28     -88888      Snow
3  01-04-2017       -99999          7  no event
4  01-05-2017           32     -88888      Rain
5  01-06-2017           31          2     Sunny
6  01-06-2017           34          5  no event

In [22]:
# Replacing per column
new_df = df.replace({'temperature': -99999, 'windspeed': -88888, 'event': 'no event'}, np.nan)
new_df

          day  temperature  windspeed  event
0  01-01-2017         32.0        6.0   Rain
1  01-02-2017          NaN        7.0  Sunny
2  01-03-2017         28.0        NaN   Snow
3  01-04-2017          NaN        7.0    NaN
4  01-05-2017         32.0        NaN   Rain
5  01-06-2017         31.0        2.0  Sunny
6  01-06-2017         34.0        5.0    NaN

In [23]:
# Replacing by using mapping
df = pd.read_csv('replace_data1.csv')
df

          day  temperature  windspeed     event
0  01-01-2017           32          6      Rain
1  01-02-2017       -99999          7     Sunny
2  01-03-2017           28     -99999      Snow
3  01-04-2017       -99999          7  no event
4  01-05-2017           32     -99999      Rain
5  01-06-2017           31          2     Sunny
6  01-06-2017           34          5  no event

In [26]:
new_df = df.replace({-99999: np.nan, 'no event': 'Sunny'})
new_df

new_df.to_csv('file_name.csv')
# csv, excel
# tsv,txt

In [ ]:
# ---------------------------------------------------------------------

In [29]:
df1 = pd.DataFrame({'Name': ['Vicky', 'Bill'], 'Age': [12, 46]})
df2 = pd.DataFrame({'Name': ['John', 'Sabrina'], 'Age': [37,25]})
df1

    Name  Age
0  Vicky   12
1   Bill   46

In [30]:
df2

      Name  Age
0     John   37
1  Sabrina   25

In [31]:
# Concat horizontally
cars = pd.concat([df1, df2], axis=1)
cars

    Name  Age     Name  Age
0  Vicky   12     John   37
1   Bill   46  Sabrina   25

In [33]:
# concat vertically and ignore index
df3 = pd.concat([df1, df2], axis=0, ignore_index=True)
df3

      Name  Age
0    Vicky   12
1     Bill   46
2     John   37
3  Sabrina   25

In [34]:
df4 = pd.DataFrame({'Name': ['Tyler', 'Natalie'], 'Age': [28,39], 'Hobby': ['Swimming', 'Reading']})
df4

      Name  Age     Hobby
0    Tyler   28  Swimming
1  Natalie   39   Reading

In [35]:
# Outer is the default for the join argument --- Outer does not consider any difference in column b/w two dataframes.
pd.concat([df3, df4], join = 'outer', ignore_index=True)

      Name  Age     Hobby
0    Vicky   12       NaN
1     Bill   46       NaN
2     John   37       NaN
3  Sabrina   25       NaN
4    Tyler   28  Swimming
5  Natalie   39   Reading

In [36]:
# Inner stacks only the columns that are shared between the two dataframes.
pd.concat([df3,df4], join = 'inner', ignore_index=True)

      Name  Age
0    Vicky   12
1     Bill   46
2     John   37
3  Sabrina   25
4    Tyler   28
5  Natalie   39

In [37]:
# Merge --  focus of rows.
size = pd.DataFrame({'Colour': ['Red', 'Blue', 'Green'], 'Size': ['M', 'S', 'M']})
gender = pd.DataFrame({'Colour': ['Red', 'Blue', 'Yellow'], 'Sex': ['Female', 'Female', 'Male']})
size

  Colour Size
0    Red    M
1   Blue    S
2  Green    M

In [38]:
gender

   Colour     Sex
0     Red  Female
1    Blue  Female
2  Yellow    Male

In [39]:
pd.merge(size, gender, how='inner')

  Colour Size     Sex
0    Red    M  Female
1   Blue    S  Female

In [40]:
pd.merge(size, gender, how='outer')

   Colour Size     Sex
0    Blue    S  Female
1   Green    M     NaN
2     Red    M  Female
3  Yellow  NaN    Male

In [41]:
pd.merge(size, gender, how='left')

  Colour Size     Sex
0    Red    M  Female
1   Blue    S  Female
2  Green    M     NaN

In [42]:
pd.merge(size, gender, how='right')

   Colour Size     Sex
0     Red    M  Female
1    Blue    S  Female
2  Yellow  NaN    Male